# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  # Conv(=CBL) args: output_channels, kernel, stride, padding, groups, activation
  # groups: input을 group 수로 나눠서 Convolution 수행 후 concat
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 0-P1/2  
  
   [-1, 1, Conv, [64, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 1-P2/4    
   
  # ReLU(1)은 inplace=True
  # Inception Block V1
  [-1, 1, Conv, [32, 1, 1, None, 1, nn.ReLU(1)]], # 2
  [-2, 1, Conv, [32, 3, 1, 1, 1, nn.ReLU(1)]],
  [-3, 1, Conv, [32, 5, 1, 2, 1, nn.ReLU(1)]],
  [-4, 1, SP, [3, 1]], 
  [-1, 1, Conv, [32, 1, 1, None, 1, nn.ReLU(1)]],
  [[-5, -4, -3, -1], 1, Concat, [1]],
  [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 8

  [-1, 1, MP, []], # 9
  [-1, 1, Conv, [64, 1, 1, None, 1, nn.ReLU(1)]], # 10
  [-2, 1, Conv, [64, 3, 1, 1, 1, nn.ReLU(1)]],
  [-3, 1, Conv, [64, 5, 1, 2, 1, nn.ReLU(1)]],
  [-4, 1, SP, [3, 1]], 
  [-1, 1, Conv, [64, 1, 1, None, 1, nn.ReLU(1)]],
  [[-5, -4, -3, -1], 1, Concat, [1]],
  [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 16
   
  [-1, 1, MP, []], # 17
  [-1, 1, Conv, [128, 1, 1, None, 1, nn.ReLU(1)]], # 18
  [-2, 1, Conv, [128, 3, 1, 1, 1, nn.ReLU(1)]],
  [-3, 1, Conv, [128, 5, 1, 2, 1, nn.ReLU(1)]],
  [-4, 1, SP, [3, 1]], 
  [-1, 1, Conv, [128, 1, 1, None, 1, nn.ReLU(1)]],
  [[-5, -4, -3, -1], 1, Concat, [1]],
  [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 24
  
  [-1, 1, MP, []], # 25
  [-1, 1, Conv, [256, 1, 1, None, 1, nn.ReLU(1)]], # 26
  [-2, 1, Conv, [256, 3, 1, 1, 1, nn.ReLU(1)]],
  [-3, 1, Conv, [256, 5, 1, 2, 1, nn.ReLU(1)]],
  [-4, 1, SP, [3, 1]], 
  [-1, 1, Conv, [256, 1, 1, None, 1, nn.ReLU(1)]],
  [[-5, -4, -3, -1], 1, Concat, [1]],
  [-1, 1, Conv, [512, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 32
  ]

# yolov7-tiny head
head:
  [[-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # SPPCSPC
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, SP, [5]], # MaxPool (kernel 지정, stride=1 고정), MP module은 MaxPool(kernel=stride)
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 41
  
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], 
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [24, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
  [-1, 1, Conv, [64, 1, 1, None, 1, nn.ReLU(1)]], # 46
  [-2, 1, Conv, [64, 3, 1, 1, 1, nn.ReLU(1)]],
  [-3, 1, Conv, [64, 5, 1, 2, 1, nn.ReLU(1)]],
  [-4, 1, SP, [3, 1]], 
  [-1, 1, Conv, [64, 1, 1, None, 1, nn.ReLU(1)]],
  [[-5, -4, -3, -1], 1, Concat, [1]],
  [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 52
  
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [16, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
  [-1, 1, Conv, [32, 1, 1, None, 1, nn.ReLU(1)]], # 57
  [-2, 1, Conv, [32, 3, 1, 1, 1, nn.ReLU(1)]],
  [-3, 1, Conv, [32, 5, 1, 2, 1, nn.ReLU(1)]],
  [-4, 1, SP, [3, 1]], 
  [-1, 1, Conv, [32, 1, 1, None, 1, nn.ReLU(1)]],
  [[-5, -4, -3, -1], 1, Concat, [1]],
  [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 63
   
   [-1, 1, Conv, [128, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 52], 1, Concat, [1]],
   
  [-1, 1, Conv, [64, 1, 1, None, 1, nn.ReLU(1)]], # 66
  [-2, 1, Conv, [64, 3, 1, 1, 1, nn.ReLU(1)]],
  [-3, 1, Conv, [64, 5, 1, 2, 1, nn.ReLU(1)]],
  [-4, 1, SP, [3, 1]], 
  [-1, 1, Conv, [64, 1, 1, None, 1, nn.ReLU(1)]],
  [[-5, -4, -3, -1], 1, Concat, [1]],
  [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 72
   
   [-1, 1, Conv, [256, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 41], 1, Concat, [1]],
   
  [-1, 1, Conv, [128, 1, 1, None, 1, nn.ReLU(1)]], # 75
  [-2, 1, Conv, [128, 3, 1, 1, 1, nn.ReLU(1)]],
  [-3, 1, Conv, [128, 5, 1, 2, 1, nn.ReLU(1)]],
  [-4, 1, SP, [3, 1]], 
  [-1, 1, Conv, [128, 1, 1, None, 1, nn.ReLU(1)]],
  [[-5, -4, -3, -1], 1, Concat, [1]],
  [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 81
      
   [63, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 80x80
   [72, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 40x40
   [81, 1, Conv, [512, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 20x20

   [[85,86,87], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
